In [2]:
import numpy  as np

In [3]:
import pandas as  pd

In [4]:
data = np.random.randint(0,100, size = (4,3))

In [5]:
data

array([[40, 83, 13],
       [39, 89, 14],
       [65, 79, 97],
       [52, 45, 73]], dtype=int32)

In [6]:
data_frame = pd.DataFrame(data)

In [7]:
data_frame

    0   1   2
0  40  83  13
1  39  89  14
2  65  79  97
3  52  45  73

In [8]:
data_frame = pd.DataFrame(data, index=["Cemre","Cleo","Marcus","Emirhan"], columns = ["Age","Money","Children"])

In [9]:
data_frame

         Age  Money  Children
Cemre     40     83        13
Cleo      39     89        14
Marcus    65     79        97
Emirhan   52     45        73

In [10]:
data_frame["Age"]

Cemre      40
Cleo       39
Marcus     65
Emirhan    52
Name: Age, dtype: int32

In [11]:
data_frame["Money"]

Cemre      83
Cleo       89
Marcus     79
Emirhan    45
Name: Money, dtype: int32

In [12]:
data_frame.loc["Cemre"] # indexleri çağırmak için böyle yazılır eğer indexler sayıyla verildiyse loc yerine iloc yazılır

Age         40
Money       83
Children    13
Name: Cemre, dtype: int32

In [13]:
data_frame.iloc[:,1] # kolonları  loc konumuyla bulma formulü

Cemre      83
Cleo       89
Marcus     79
Emirhan    45
Name: Money, dtype: int32

In [14]:
 data_frame[["Age","Money"]] # birden fazla kolon çağırmak için 2 parantez kullanılır

         Age  Money
Cemre     40     83
Cleo      39     89
Marcus    65     79
Emirhan   52     45

In [15]:
df=data_frame

In [16]:
df["Extra"]=10 # extra adında kolon ekler bütün satırlarını 10 değeri ile doldurur.

In [17]:
df

         Age  Money  Children  Extra
Cemre     40     83        13     10
Cleo      39     89        14     10
Marcus    65     79        97     10
Emirhan   52     45        73     10

In [18]:
df.drop("Extra", axis=1, inplace=True) 
# axis=1 kodu kolonu silmesi içindir , axis değeri belirtilmezse 0 da kalır ve eğer silmek istediğimiz kolonla aynı isimde satır varsa ilk onu siler.
#inplace= True kodu yapılan değişikliği dataya işler eski değerin döndürülmesini engeller.

In [19]:
df

         Age  Money  Children
Cemre     40     83        13
Cleo      39     89        14
Marcus    65     79        97
Emirhan   52     45        73

In [20]:
df.loc["Cemre"]["Age"]

np.int32(40)

In [21]:
df.loc["Cemre","Age"]

np.int32(40)

In [22]:
df.loc["Cemre","Age"] = 20

In [23]:
df

         Age  Money  Children
Cemre     20     83        13
Cleo      39     89        14
Marcus    65     79        97
Emirhan   52     45        73

In [24]:
df > 20

           Age  Money  Children
Cemre    False   True     False
Cleo      True   True     False
Marcus    True   True      True
Emirhan   True   True      True

In [25]:
df[df>20]

          Age  Money  Children
Cemre     NaN     83       NaN
Cleo     39.0     89       NaN
Marcus   65.0     79      97.0
Emirhan  52.0     45      73.0

In [26]:
df[df["Age"]>20]

         Age  Money  Children
Cleo      39     89        14
Marcus    65     79        97
Emirhan   52     45        73

In [27]:
df.reset_index()

     index  Age  Money  Children
0    Cemre   20     83        13
1     Cleo   39     89        14
2   Marcus   65     79        97
3  Emirhan   52     45        73

In [28]:
reset_df = df.reset_index()

In [29]:
reset_df

     index  Age  Money  Children
0    Cemre   20     83        13
1     Cleo   39     89        14
2   Marcus   65     79        97
3  Emirhan   52     45        73

In [30]:
reset_df.loc[0]["Age"]

np.int32(20)

In [31]:
new_index= ["Cemo","Cleo","Marcus","Emo"]

In [32]:
df["New_Index"]= new_index

In [33]:
df

         Age  Money  Children New_Index
Cemre     20     83        13      Cemo
Cleo      39     89        14      Cleo
Marcus    65     79        97    Marcus
Emirhan   52     45        73       Emo

In [34]:
df.set_index("New_Index" , inplace=True) # index değiştirmek için özel method

In [35]:
df

           Age  Money  Children
New_Index
Cemo        20     83        13
Cleo        39     89        14
Marcus      65     79        97
Emo         52     45        73

### Multi Index

In [36]:
first_index = ["Got","Got","Got","Hotd","Hotd","Hotd"]

In [37]:
inner_index = ["Dany","Jon","Arya","Daemon","Rhenrya","Viserys"]

In [39]:
zipped_index= list(zip(first_index,inner_index))

In [40]:
zipped_index

[('Got', 'Dany'),
 ('Got', 'Jon'),
 ('Got', 'Arya'),
 ('Hotd', 'Daemon'),
 ('Hotd', 'Rhenrya'),
 ('Hotd', 'Viserys')]

In [41]:
zipped_index = pd.MultiIndex.from_tuples(zipped_index)

In [42]:
zipped_index

MultiIndex([( 'Got',    'Dany'),
            ( 'Got',     'Jon'),
            ( 'Got',    'Arya'),
            ('Hotd',  'Daemon'),
            ('Hotd', 'Rhenrya'),
            ('Hotd', 'Viserys')],
           )

In [44]:
sample_index = np.ones((6,2))

In [47]:
last_frame = pd.DataFrame(sample_index , index=zipped_index, columns=["Age","Salary"])

In [48]:
last_frame

              Age  Salary
Got  Dany     1.0     1.0
     Jon      1.0     1.0
     Arya     1.0     1.0
Hotd Daemon   1.0     1.0
     Rhenrya  1.0     1.0
     Viserys  1.0     1.0

In [50]:
last_frame.loc["Got"].loc["Dany"] #multydata olduğunda indexlere ulaşmak için loc fonksiyonu bu şekilde kullanılır.

Age       1.0
Salary    1.0
Name: Dany, dtype: float64